src/Catalogs/Products.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Catalog>
		<Properties>
			<Name>Products</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>SKU</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Vendor</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Counterparties</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PictureFile</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.StoredFiles</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Kind</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ProductKinds</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Barcode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Details</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>AdditionalAttributes</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Property</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.AdditionalDataAndAttributes</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.AdditionalDataAndAttributes</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TextString</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/ProductPrices.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<InformationRegister>
		<Properties>
			<Name>ProductPrices</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Price</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Product</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Products</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>PriceKind</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PriceKinds</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/Products/Ext/ManagerModule.bsl
// StandardSubsystems.Print

Процедура AddPrintCommands(PrintCommands) Export
	
	//Product expense
	PrintCommand = PrintCommands.Добавить();
    PrintCommand.PrintManager = "Catalog.Products";
    PrintCommand.ID = "BarcodePrintTemplate";
    PrintCommand.Presentation = NStr("en = 'Barcode'");
    PrintCommand.CheckPostingBeforePrint = True;
	
	//Product expense - print immediately
	PrintCommand = PrintCommands.Добавить();
    PrintCommand.PrintManager = "Catalog.Products";
    PrintCommand.ID = "BarcodePrintTemplate";
    PrintCommand.Presentation = NStr("en = 'Barcode (skip preview)'");
	PrintCommand.Picture = PictureLib.PrintImmediately;
    PrintCommand.CheckPostingBeforePrint = True;
	PrintCommand.SkipPreview = True;
	
	//Product expense in Adobe PDF format
	PrintCommand = PrintCommands.Добавить();
    PrintCommand.PrintManager = "Catalog.Products";
    PrintCommand.ID = "BarcodePrintTemplate";
    PrintCommand.Presentation = NStr("en = 'Barcode in Adobe PDF format'");
	PrintCommand.Picture = PictureLib.PDFFormat;
    PrintCommand.CheckPostingBeforePrint = True;
	PrintCommand.SavingFormat = SpreadsheetDocumentFileType.PDF;
	
	//Delivery request
	PrintCommand = PrintCommands.Добавить();
    PrintCommand.PrintManager = "Catalog.Products";
    PrintCommand.ID = "PriceListTemplate";
    PrintCommand.Presentation = NStr("en = 'Price list'");
    PrintCommand.CheckPostingBeforePrint = True;
	
	//Delivery request - print immediately
	PrintCommand = PrintCommands.Добавить();
    PrintCommand.PrintManager = "Catalog.Products";
    PrintCommand.ID = "PriceListTemplate";
    PrintCommand.Presentation = NStr("en = 'Price list (skip preview)'");
	PrintCommand.Picture = PictureLib.PrintImmediately;
    PrintCommand.CheckPostingBeforePrint = True;
	PrintCommand.SkipPreview = True;
	
	//Delivery request in Adobe PDF format
	PrintCommand = PrintCommands.Добавить();
    PrintCommand.PrintManager = "Catalog.Products";
    PrintCommand.ID = "PriceListTemplate";
    PrintCommand.Presentation = NStr("en = 'Price list in Adobe PDF format'");
	PrintCommand.Picture = PictureLib.PDFFormat;
    PrintCommand.CheckPostingBeforePrint = True;
	PrintCommand.SavingFormat = SpreadsheetDocumentFileType.PDF;
	
	
КонецПроцедуры

Procedure Print(ObjectArray, PrintParameters, PrintFormCollection, PrintObjects, OutputParameters) Export

	MustPrintTemplate = PrintManagement.MustPrintTemplate(PrintFormCollection, "BarcodePrintTemplate");
	If MustPrintTemplate Then
	    PrintManagement.OutputSpreadsheetDocumentToCollection(
		PrintFormCollection,
	    "BarcodePrintTemplate",
	    NStr("en = 'Barcode'"),
	    PrintBarcode(ObjectArray, PrintObjects),
	    ,
	    "Catalog.Products.BarcodePrintTemplate");
	EndIf;
	
	MustPrintTemplate = PrintManagement.MustPrintTemplate(PrintFormCollection, "PriceListTemplate");
	If MustPrintTemplate Then
	    PrintManagement.OutputSpreadsheetDocumentToCollection(
		PrintFormCollection,
	    "PriceListTemplate",
	    NStr("en = 'Price list'"),
	    PrintPriceList(ObjectArray, PrintObjects),
	    ,
	    "Catalog.Products.PriceListTemplate");
	EndIf;

EndProcedure

Function PrintBarcode(ObjectArray, PrintObjects)

	QueryText = "SELECT
	            |	Products.Ref
	            |FROM
	            |	Catalog.Products AS Products
	            |WHERE
	            |	Products.Ref IN(&ObjectArray)";
				
	Query = New Query(QueryText);
	Query.SetParameter("ObjectArray", ObjectArray);
	
	Header = Query.Execute().Select();
	
	SpreadsheetDocument = New SpreadsheetDocument;
	
	Template = Catalogs.Products.GetTemplate("BarcodePrintTemplate");
	
	While Header.Next() Do
		
		FirstRowNumber = SpreadsheetDocument.TableHeight + 1;
		
		Object = Header.Ref.GetObject();
		Object.BarcodePrintForm(SpreadsheetDocument);
		
		PrintManagement.SetDocumentPrintArea(SpreadsheetDocument, FirstRowNumber, PrintObjects, Header.Ref);
		
	EndDo;
	
	Return SpreadsheetDocument;	

EndFunction // PrintBarcode()

Function PrintPriceList(ObjectArray, PrintObjects)

	QueryText = "SELECT
	            |	Products.Ref
	            |FROM
	            |	Catalog.Products AS Products
	            |WHERE
	            |	Products.Ref IN(&ObjectArray)";
				
	Query = New Query(QueryText);
	Query.SetParameter("ObjectArray", ObjectArray);
	
	Header = Query.Execute().Select();
	
    Query.Text =  "SELECT
                  |	Products.Code AS Code,
                  |	Products.Description AS Description,
                  |	Products.SKU AS SKU,
                  |	Products.PictureFile AS Picture,
                  |	Products.Details AS Details,
                  |	Products.Kind AS Kind,
                  |	ProductPrices.Price AS Price,
                  |	Products.Ref
                  |FROM
                  |	Catalog.Products AS Products
                  |		LEFT JOIN InformationRegister.ProductPrices AS ProductPrices
                  |		ON Products.Ref = ProductPrices.Product
                  |WHERE
                  |	Products.IsFolder = FALSE
                  |	AND ProductPrices.PriceKind = &PriceKind
                  |	AND Products.Ref IN(&ObjectArray)
                  |
                  |ORDER BY
                  |	Kind,
                  |	Products.Parent.Code,
                  |	Code";

    Query.SetParameter("PriceKind", Catalogs.PriceKinds.FindByDescription("Retail"));
						
	Selection = Query.Execute().Select();
	
	SpreadsheetDocument = New SpreadsheetDocument;
	
	Template = Catalogs.Products.GetTemplate("PriceListTemplate");
	
	SpreadsheetDocument.Put(Template.GetArea("Header"));
	
	While Header.Next() Do
		
		FirstRowNumber = SpreadsheetDocument.TableHeight + 1;
		
		Selection.Reset();
		
		TemplArea = Template.GetArea("ItemsArea");
		
		While Selection.FindNext(New Structure("Ref", Header.Ref)) Do
			TemplArea.Parameters.Fill(Selection);
		    SpreadsheetDocument.Put(TemplArea);
		EndDo; 
		
		PrintManagement.SetDocumentPrintArea(SpreadsheetDocument, FirstRowNumber, PrintObjects, Header.Ref);
		
	EndDo;
	
	Return SpreadsheetDocument;	

EndFunction // PrintPriceList()

// End StandardSubsystems.Print
